In [1]:
import pymysql
import pandas as pd
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

 ![png](images/image_ERD.png)

In [2]:
connection = "mysql+pymysql://root:Afshan0712@localhost/books"

In [3]:
engine = create_engine(connection, echo=True)

In [4]:
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [7]:
""""create_database(connection)

SyntaxError: EOF while scanning triple-quoted string literal (1522750945.py, line 1)

In [8]:
database_exists(connection)

True

In [9]:
df= pd.read_csv('Data/data.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
df.to_sql('data', engine, if_exists = 'replace')

2022-12-03 20:06:41,727 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-12-03 20:06:41,729 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:41,734 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2022-12-03 20:06:41,737 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:41,741 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2022-12-03 20:06:41,743 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:41,752 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:41,754 INFO sqlalchemy.engine.Engine [generated in 0.00275s] {'table_schema': 'books', 'table_name': 'data'}
2022-12-03 20:06:41,830 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:41,831 INFO sqlalchemy.engine.Engine [cached since 0.07934s ago] {'table_schema': 'books', 'table_name': 'data'}
2022-12-03 20:06:41,846 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `books`
2022-12-03 20:06:41,848 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:41,897 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `data`
2022-12-03 20:06:41,900 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:41,930 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:41,932 INFO sqlalchemy.engine.Engine
DROP TABLE data
2022-12-03 20:06:41,936 INFO sqlalchemy.engine.Engine [no key 0.00418s] {}
2022-12-03 20:06:42,067 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:42,071 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:42,074 INFO sqlalchemy.engine.Engine
CREATE TABLE data (
	`index` BIGINT,
	id BIGINT,
	first_name TEXT,
	last_name TEXT,
	email TEXT
)


2022-12-03 20:06:42,076 INFO sqlalchemy.engine.Engine [no key 0.00148s] {}
2022-12-03 20:06:42,166 INFO sqlalchemy.engine.Engine CREATE INDEX ix_data_index ON data (`index`)
2022-12-03 20:06:42,167 INFO sqlalchemy.engine.Engine [no key 0.00091s] {}
2022-12-03 20:06:42,222 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:42,233 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:42,235 INFO sqlalchemy.engine.Engine INSERT INTO data (`index`, id, first_name, last_name, email) VALUES (%(index)s, %(id)s, %(first_name)s, %(last_name)s, %(email)s)
2022-12-03 20:06:42,238 INFO sqlalchemy.engine.Engine [generated in 0.00261s] ({'index': 0, 'id': 1, 'first_name': 'John', 'last_name': 'Doe', 'email': 'JD@books.com'}, {'index': 1, 'id': 2, 'first_name': 'Robin', 'last_name': 'Smith', 'email': 'Robin@books.com'}, {'index': 2, 'id': 3, 'first_name': 'Gloria', 'last_name': 'Rodriguez', 'email': 'grodriquez@books.com'})
2022-12-03 20:06:42,245 INFO sqlalchemy.engine.Engine COMMIT

3

In [11]:
q = """SELECT * FROM Data LIMIT 5;"""
pd.read_sql(q, engine)

2022-12-03 20:06:46,456 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:46,463 INFO sqlalchemy.engine.Engine [cached since 4.712s ago] {'table_schema': 'books', 'table_name': 'SELECT * FROM Data LIMIT 5;'}
2022-12-03 20:06:46,476 INFO sqlalchemy.engine.Engine SELECT * FROM Data LIMIT 5;
2022-12-03 20:06:46,477 INFO sqlalchemy.engine.Engine [raw sql] {}

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [12]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

2022-12-03 20:06:52,396 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:52,400 INFO sqlalchemy.engine.Engine [cached since 10.65s ago] {'table_schema': 'books', 'table_name': 'SHOW TABLES;'}
2022-12-03 20:06:52,419 INFO sqlalchemy.engine.Engine SHOW TABLES;
2022-12-03 20:06:52,421 INFO sqlalchemy.engine.Engine [raw sql] {}

  Tables_in_books
0            data
1          data-2
2          data-3
3          data-4
4          data_2
5          data_3
6          data_4

In [13]:
df_2 = pd.read_csv('data/data-2.csv')
df_3 = pd.read_csv('data/data-3.csv')
df_4 = pd.read_csv('data/data-4.csv')

In [14]:
df_2.to_sql('data_2', engine, if_exists = 'replace')
df_3.to_sql('data_3', engine, if_exists = 'replace')
df_4.to_sql('data_4', engine, if_exists = 'replace')

2022-12-03 20:06:52,515 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:52,525 INFO sqlalchemy.engine.Engine [cached since 10.77s ago] {'table_schema': 'books', 'table_name': 'data_2'}
2022-12-03 20:06:52,541 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:52,544 INFO sqlalchemy.engine.Engine [cached since 10.79s ago] {'table_schema': 'books', 'table_name': 'data_2'}
2022-12-03 20:06:52,565 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `books`
2022-12-03 20:06:52,567 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:52,579 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `data_2`
2022-12-03 20:06:52,583 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:52,607 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:52,609 INFO sqlalchemy.engine.Engine
DROP TABLE data_2
2022-12-03 20:06:52,611 INFO sqlalchemy.engine.Engine [no key 0.00209s] {}
2022-12-03 20:06:52,659 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:52,677 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:52,686 INFO sqlalchemy.engine.Engine
CREATE TABLE data_2 (
	`index` BIGINT,
	id BIGINT,
	title TEXT,
	author_id BIGINT
)


2022-12-03 20:06:52,691 INFO sqlalchemy.engine.Engine [no key 0.00556s] {}
2022-12-03 20:06:52,725 INFO sqlalchemy.engine.Engine CREATE INDEX ix_data_2_index ON data_2 (`index`)
2022-12-03 20:06:52,726 INFO sqlalchemy.engine.Engine [no key 0.00116s] {}
2022-12-03 20:06:52,792 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:52,815 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:52,824 INFO sqlalchemy.engine.Engine INSERT INTO data_2 (`index`, id, title, author_id) VALUES (%(index)s, %(id)s, %(title)s, %(author_id)s)
2022-12-03 20:06:52,833 INFO sqlalchemy.engine.Engine [generated in 0.00895s] ({'index': 0, 'id': 1, 'title': 'The Shining', 'author_id': 1}, {'index': 1, 'id': 2, 'title': 'It', 'author_id': 1}, {'index': 2, 'id': 3, 'title': 'The Great Gatsby', 'author_id': 2}, {'index': 3, 'id': 4, 'title': 'The Call of the Wild', 'author_id': 3}, {'index': 4, 'id': 5, 'title': 'Pride and Prejudice', 'author_id': 4}, {'index': 5, 'id': 6, 'title': 'Frankenstein', 'author_id': 5})
2022-12-03 20:06:52,862 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:52,878 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:52,880 INFO sqlalchemy.engine.Engine [cached since 11.13s ago] {'table_schema': 'books', 'table_name': 'data_3'}
2022-12-03 20:06:52,893 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:52,896 INFO sqlalchemy.engine.Engine [cached since 11.14s ago] {'table_schema': 'books', 'table_name': 'data_3'}
2022-12-03 20:06:52,909 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `books`
2022-12-03 20:06:52,910 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:52,922 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `data_3`
2022-12-03 20:06:52,927 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:52,937 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:52,938 INFO sqlalchemy.engine.Engine
DROP TABLE data_3
2022-12-03 20:06:52,940 INFO sqlalchemy.engine.Engine [no key 0.00257s] {}
2022-12-03 20:06:52,973 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:52,978 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:52,982 INFO sqlalchemy.engine.Engine
CREATE TABLE data_3 (
	`index` BIGINT,
	id BIGINT,
	author_name TEXT
)


2022-12-03 20:06:52,990 INFO sqlalchemy.engine.Engine [no key 0.00794s] {}
2022-12-03 20:06:53,035 INFO sqlalchemy.engine.Engine CREATE INDEX ix_data_3_index ON data_3 (`index`)
2022-12-03 20:06:53,045 INFO sqlalchemy.engine.Engine [no key 0.00987s] {}
2022-12-03 20:06:53,080 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:53,086 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:53,089 INFO sqlalchemy.engine.Engine INSERT INTO data_3 (`index`, id, author_name) VALUES (%(index)s, %(id)s, %(author_name)s)
2022-12-03 20:06:53,090 INFO sqlalchemy.engine.Engine [generated in 0.00166s] ({'index': 0, 'id': 1, 'author_name': 'Stephen King'}, {'index': 1, 'id': 2, 'author_name': 'F.Scott Fitgerald'}, {'index': 2, 'id': 3, 'author_name': 'Jack London'}, {'index': 3, 'id': 4, 'author_name': 'Jane Austen'}, {'index': 4, 'id': 5, 'author_name': 'Mary Shelley'})
2022-12-03 20:06:53,097 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:53,108 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:53,112 INFO sqlalchemy.engine.Engine [cached since 11.36s ago] {'table_schema': 'books', 'table_name': 'data_4'}
2022-12-03 20:06:53,124 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:53,126 INFO sqlalchemy.engine.Engine [cached since 11.37s ago] {'table_schema': 'books', 'table_name': 'data_4'}
2022-12-03 20:06:53,132 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `books`
2022-12-03 20:06:53,134 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:53,143 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `data_4`
2022-12-03 20:06:53,145 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-12-03 20:06:53,154 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:53,155 INFO sqlalchemy.engine.Engine
DROP TABLE data_4
2022-12-03 20:06:53,157 INFO sqlalchemy.engine.Engine [no key 0.00191s] {}
2022-12-03 20:06:53,175 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:53,181 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:53,186 INFO sqlalchemy.engine.Engine
CREATE TABLE data_4 (
	`index` BIGINT,
	user_id BIGINT,
	book_id BIGINT
)


2022-12-03 20:06:53,191 INFO sqlalchemy.engine.Engine [no key 0.00492s] {}
2022-12-03 20:06:53,212 INFO sqlalchemy.engine.Engine CREATE INDEX ix_data_4_index ON data_4 (`index`)
2022-12-03 20:06:53,213 INFO sqlalchemy.engine.Engine [no key 0.00135s] {}
2022-12-03 20:06:53,269 INFO sqlalchemy.engine.Engine COMMIT
2022-12-03 20:06:53,274 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-03 20:06:53,276 INFO sqlalchemy.engine.Engine INSERT INTO data_4 (`index`, user_id, book_id) VALUES (%(index)s, %(user_id)s, %(book_id)s)
2022-12-03 20:06:53,278 INFO sqlalchemy.engine.Engine [generated in 0.00232s] ({'index': 0, 'user_id': 1, 'book_id': 1}, {'index': 1, 'user_id': 1, 'book_id': 2}, {'index': 2, 'user_id': 1, 'book_id': 3}, {'index': 3, 'user_id': 2, 'book_id': 4}, {'index': 4, 'user_id': 2, 'book_id': 5}, {'index': 5, 'user_id': 3, 'book_id': 5}, {'index': 6, 'user_id': 3, 'book_id': 6})
2022-12-03 20:06:53,295 INFO sqlalchemy.engine.Engine COMMIT

7

In [15]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

2022-12-03 20:06:53,328 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:53,336 INFO sqlalchemy.engine.Engine [cached since 11.58s ago] {'table_schema': 'books', 'table_name': 'SHOW TABLES;'}
2022-12-03 20:06:53,342 INFO sqlalchemy.engine.Engine SHOW TABLES;
2022-12-03 20:06:53,344 INFO sqlalchemy.engine.Engine [raw sql] {}

  Tables_in_books
0            data
1          data-2
2          data-3
3          data-4
4          data_2
5          data_3
6          data_4

In [32]:
q= """ SELECT * FROM data
"""
pd.read_sql(q, engine)

2022-12-03 20:39:11,876 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:39:11,880 INFO sqlalchemy.engine.Engine [cached since 1950s ago] {'table_schema': 'books', 'table_name': ' SELECT * FROM data\n'}
2022-12-03 20:39:11,886 INFO sqlalchemy.engine.Engine  SELECT * FROM data

2022-12-03 20:39:11,888 INFO sqlalchemy.engine.Engine [raw sql] {}

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [17]:
q = """ SELECT * FROM data_2
"""
pd.read_sql(q, engine)

2022-12-03 20:06:53,535 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:06:53,544 INFO sqlalchemy.engine.Engine [cached since 11.79s ago] {'table_schema': 'books', 'table_name': ' SELECT * FROM data_2\n'}
2022-12-03 20:06:53,559 INFO sqlalchemy.engine.Engine  SELECT * FROM data_2

2022-12-03 20:06:53,561 INFO sqlalchemy.engine.Engine [raw sql] {}

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

In [33]:
q = """
SELECT data_2.title , data_4.user_id

FROM data_2

JOIN data_4 ON data_2.id = data_4.book_id

WHERE data_4.user_id = 

    (SELECT data.id FROM data WHERE (data.last_name = 'Doe'
    AND data.first_name = 'John'));

"""
pd.read_sql(q, engine)

2022-12-03 20:41:04,131 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %(table_schema)s AND table_name = %(table_name)s
2022-12-03 20:41:04,137 INFO sqlalchemy.engine.Engine [cached since 2062s ago] {'table_schema': 'books', 'table_name': "\nSELECT data_2.title , data_4.user_id\n\nFROM data_2\n\nJOIN data_4 ON data_2.id = data_4.book_id\n\nWHERE data_4.user_id = \n\n    (SELECT data.id FROM data WHERE (data.last_name = 'Doe'\n    AND data.first_name = 'John'));\n\n"}
2022-12-03 20:41:04,151 INFO sqlalchemy.engine.Engine
SELECT data_2.title , data_4.user_id

FROM data_2

JOIN data_4 ON data_2.id = data_4.book_id

WHERE data_4.user_id =

    (SELECT data.id FROM data WHERE (data.last_name = 'Doe'
    AND data.first_name = 'John'));


2022-12-03 20:41:04,154 INFO sqlalchemy.engine.Engine [raw sql] {}

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1